loadtest/.runs3/log-200.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/capacidade.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m10s max duration (incl. graceful stop):
              * navegacao: Up to 200 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 018/200 VUs, 0 complete and 0 interrupted iterations
navegacao   [   2% ] 018/200 VUs  00.9s/40.0s

running (0m01.9s), 038/200 VUs, 8 complete and 0 interrupted iterations
navegacao   [   5% ] 038/200 VUs  01.9s/40.0s

running (0m02.9s), 058/200 VUs, 40 complete and 0 interrupted iterations
navegacao   [   7% ] 058/200 VUs  02.9s/40.0s

running (0m03.9s), 078/200 VUs, 70 complete and 0 interrupted iterations
navegacao   [  10% ] 078/200 VUs  03.9s/40.0s

running (0m04.9s), 098/200 VUs, 120 complete and 0 interrupted iterations
navegacao   [  12% ] 098/200 VUs  04.9s/40.0s

running (0m05.9s), 118/200 VUs, 142 complete and 0 interrupted iterations
navegacao   [  15% ] 118/200 VUs  05.9s/40.0s

running (0m06.9s), 138/200 VUs, 178 complete and 0 interrupted iterations
navegacao   [  17% ] 138/200 VUs  06.9s/40.0s

running (0m07.9s), 158/200 VUs, 229 complete and 0 interrupted iterations
navegacao   [  20% ] 158/200 VUs  07.9s/40.0s

running (0m08.9s), 178/200 VUs, 276 complete and 0 interrupted iterations
navegacao   [  22% ] 178/200 VUs  08.9s/40.0s

running (0m09.9s), 198/200 VUs, 317 complete and 0 interrupted iterations
navegacao   [  25% ] 198/200 VUs  09.9s/40.0s

running (0m10.9s), 200/200 VUs, 345 complete and 0 interrupted iterations
navegacao   [  27% ] 200/200 VUs  10.9s/40.0s

running (0m11.9s), 200/200 VUs, 386 complete and 0 interrupted iterations
navegacao   [  30% ] 200/200 VUs  11.9s/40.0s

running (0m12.9s), 200/200 VUs, 431 complete and 0 interrupted iterations
navegacao   [  32% ] 200/200 VUs  12.9s/40.0s

running (0m13.9s), 200/200 VUs, 562 complete and 0 interrupted iterations
navegacao   [  35% ] 200/200 VUs  13.9s/40.0s

running (0m14.9s), 200/200 VUs, 665 complete and 0 interrupted iterations
navegacao   [  37% ] 200/200 VUs  14.9s/40.0s

running (0m15.9s), 200/200 VUs, 740 complete and 0 interrupted iterations
navegacao   [  40% ] 200/200 VUs  15.9s/40.0s

running (0m16.9s), 200/200 VUs, 801 complete and 0 interrupted iterations
navegacao   [  42% ] 200/200 VUs  16.9s/40.0s

running (0m17.9s), 200/200 VUs, 901 complete and 0 interrupted iterations
navegacao   [  45% ] 200/200 VUs  17.9s/40.0s

running (0m18.9s), 200/200 VUs, 1003 complete and 0 interrupted iterations
navegacao   [  47% ] 200/200 VUs  18.9s/40.0s

running (0m19.9s), 200/200 VUs, 1074 complete and 0 interrupted iterations
navegacao   [  50% ] 200/200 VUs  19.9s/40.0s

running (0m20.9s), 200/200 VUs, 1151 complete and 0 interrupted iterations
navegacao   [  52% ] 200/200 VUs  20.9s/40.0s

running (0m21.9s), 200/200 VUs, 1201 complete and 0 interrupted iterations
navegacao   [  55% ] 200/200 VUs  21.9s/40.0s

running (0m22.9s), 200/200 VUs, 1260 complete and 0 interrupted iterations
navegacao   [  57% ] 200/200 VUs  22.9s/40.0s

running (0m23.9s), 200/200 VUs, 1353 complete and 0 interrupted iterations
navegacao   [  60% ] 200/200 VUs  23.9s/40.0s

running (0m24.9s), 200/200 VUs, 1429 complete and 0 interrupted iterations
navegacao   [  62% ] 200/200 VUs  24.9s/40.0s

running (0m25.9s), 200/200 VUs, 1491 complete and 0 interrupted iterations
navegacao   [  65% ] 200/200 VUs  25.9s/40.0s

running (0m26.9s), 200/200 VUs, 1573 complete and 0 interrupted iterations
navegacao   [  67% ] 200/200 VUs  26.9s/40.0s

running (0m27.9s), 200/200 VUs, 1642 complete and 0 interrupted iterations
navegacao   [  70% ] 200/200 VUs  27.9s/40.0s

running (0m28.9s), 200/200 VUs, 1721 complete and 0 interrupted iterations
navegacao   [  72% ] 200/200 VUs  28.9s/40.0s

running (0m29.9s), 200/200 VUs, 1832 complete and 0 interrupted iterations
navegacao   [  75% ] 200/200 VUs  29.9s/40.0s

running (0m30.9s), 200/200 VUs, 1919 complete and 0 interrupted iterations
navegacao   [  77% ] 200/200 VUs  30.9s/40.0s

running (0m31.9s), 200/200 VUs, 1951 complete and 0 interrupted iterations
navegacao   [  80% ] 200/200 VUs  31.9s/40.0s

running (0m32.9s), 200/200 VUs, 2020 complete and 0 interrupted iterations
navegacao   [  82% ] 200/200 VUs  32.9s/40.0s

running (0m33.9s), 200/200 VUs, 2141 complete and 0 interrupted iterations
navegacao   [  85% ] 200/200 VUs  33.9s/40.0s

running (0m34.9s), 200/200 VUs, 2204 complete and 0 interrupted iterations
navegacao   [  87% ] 200/200 VUs  34.9s/40.0s

running (0m35.9s), 199/200 VUs, 2278 complete and 0 interrupted iterations
navegacao   [  90% ] 199/200 VUs  35.9s/40.0s

running (0m36.9s), 156/200 VUs, 2397 complete and 0 interrupted iterations
navegacao   [  92% ] 156/200 VUs  36.9s/40.0s

running (0m37.9s), 118/200 VUs, 2500 complete and 0 interrupted iterations
navegacao   [  95% ] 118/200 VUs  37.9s/40.0s

running (0m38.9s), 067/200 VUs, 2614 complete and 0 interrupted iterations
navegacao   [  97% ] 067/200 VUs  38.9s/40.0s

running (0m39.9s), 019/200 VUs, 2681 complete and 0 interrupted iterations
navegacao   [ 100% ] 019/200 VUs  39.9s/40.0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<1000' p(95)=907.4ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 11000   269.658881/s
    checks_succeeded...: 100.00% 11000 out of 11000
    checks_failed......: 0.00%   0 out of 11000

    ✓ login: redireciona (302/303)
    ✓ home: 200 e autenticado
    ✓ lista ativos: 200 e autenticado
    ✓ busca ativos: 200 e autenticado
    ✓ lista chamados: 200 e autenticado

    HTTP
    http_req_duration..............: avg=350.77ms min=4.77ms med=286.68ms max=2.76s p(90)=737.36ms p(95)=907.4ms
      { expected_response:true }...: avg=350.77ms min=4.77ms med=286.68ms max=2.76s p(90)=737.36ms p(95)=907.4ms
    http_req_failed................: 0.00%  0 out of 11200
    http_reqs......................: 11200  274.56177/s

    EXECUTION
    iteration_duration.............: avg=2.45s    min=1.03s  med=2.38s    max=6.71s p(90)=3.5s     p(95)=3.9s   
    iterations.....................: 2700   66.188998/s
    vus............................: 19     min=18         max=200
    vus_max........................: 200    min=200        max=200

    NETWORK
    data_received..................: 314 MB 7.7 MB/s
    data_sent......................: 1.6 MB 40 kB/s



running (0m40.8s), 000/200 VUs, 2700 complete and 0 interrupted iterations
navegacao ✓ [ 100% ] 000/200 VUs  40s